{"pages":[],"posts":[{"title":"Internet cafes in Africa","text":"The living standard of many asian people is getting higher and higher. People have computers at their homes. The word “Internet bar” is not as hot as it used to be. But for some countries in the world, especially in Africa, what is the situation of Internet cafes? Now let’s have a look. The popularity of Internet cafes in Africa is very low Due to poverty and unrest in Africa, the popularity of Internet cafes is still relatively low, and most Africans can’t access computers. Potential Internet users in Africa don’t realize the significance of using the Internet. The environment of African Internet bar is very simple It is very difficult to find a luxurious Internet cafe in Africa. Most of the Internet bar facilities at there are simple, and the computer configuration is also very low. Most of these shops are simple in appearance. Painting on the wall is a kind of decoration. Some shops still have white lime walls, and the messy wires on the walls are clearly visible. Entering the Internet bar, it is basically a simple one table one chair for each customer. There is no trace of any spacious leather sofa, cool mouse and powerful host. African Internet bar price is very expensive. What is the price of Internet bar in most Asia countries? Generally, small counties and cities cost about 0.3 to 0.5 dollar per hour, and high-end Internet cafes cost about 1 dollar. However, in the case of simple environment and slow internet speed, African Internet cafes charge more than Asian ones. In Africa, Zimbabwe,the monthly network fee is almost 1200 dollar, which is not affordable for common families. So a lot of people want to go online only to choose Internet cafes. In general, Internet cafes in Africa cost about $2 an hour. The speed of Internet cafes in Africa is very slow The bandwidth of African Internet cafes is quite low. It takes five to six minutes to open a web page. The Internet experience here is very bad.Sometimes it may take a day to download a movie. Compared with the Internet speed of some developed countries, the Internet speed of African Internet cafes is like the speed of tortoises relative to rockets. What is the behavior of Internet cafe customers in Africa？ Unlike most asian people who mainly play games, watch movies and chat in Internet cafes, African Internet cafes are often used to print documents, edit documents, send and receive e-mails, and undertake the most basic “Internet surfing” function of the Internet. This is about the current situation of African Internet cafes. Although they are relatively backward now, I believe that in the near future, Africa can also have luxury environment and high-speed Internet cafes.","link":"/2020/04/25/AfricaInternetCafe/"},{"title":"Introdution of African Food (1)","text":"Who says African food is not good? (Part A) Africa, in our impression, has always been a poor and backward continent. Even food and clothing are a problem. How can there be food? If you think so, you are biased. In fact, there are quite a lot of African cuisines, but there are very few domestic introductions to this.Today I will take you to discover what is delicious in Africa! No.1 Morocco: the collision of Africa and EuropeMorocco is a country surrounded by the Atlantic Ocean, the Mediterranean Sea, and the vast Sahara Desert. The unique geographical location makes Morocco a filming location for many movies. Morocco is located in the northwestern part of the African continent, close to European countries such as Spain and Italy. Therefore, in terms of diet, Morocco perfectly blends tradition with Western tastes, giving birth to a unique Moroccan taste TajineTajin is the most famous traditional dish in Morocco and a must-have for various festivals and celebrations. Spread beef, mutton, chicken, or seafood on a wide, shallow clay plate, and then add vegetables and various Moroccan spices. Then simmered for a few hours, the steamed dish was soft and savory and delicious.As a type of stew, Tajin is deeply loved by Moroccans: different ingredients can have different magical powers: you can either make a pot of fragrant yellow pheasant chicken or the exotic curry pot is in your hands. CouscousCouscous is a traditional staple food of Moroccans, equivalent to our rice. Couscous is colorful and unique. The bottom wheat flour absorbs the essence of the dish and looks yellow orange. The taste is soft and strong, sweet and not greasy. The couscous, which is fragrant and delicious, tastes similar to Guangdong Claypot Rice. Lentil Thick SoupMoroccan thick soups are full of variety, and the taste of each soup is different. Lentils are standard in local thick soups. As if adding thick soup pot, the whole bowl of soup has a strong taste of chicken. With the harmony of lentils, it will not make people feel too greasy and people can’t stop it. Spicy sardinesMorocco is the world’s largest exporter of sardines, so you will see many sardine vendors on the street stalls. It tastes like Guilin Chili Sauce. The cumin powder on the sardines adds a lot to it. Although the meat quality is better than firewood, it is better than crisp. Walking on the streets of Morocco, don’t be surprised if you see a bunch of spicy sardines in the hands of locals. Then all you have to do is: also order a bunch of sardines! Mint teaMint tea is the national tea of Morocco. Locals drink it all year round, and they proudly call it “Moroccan Whiskey”. The brewed tea has the fragrance of green tea and mint, which is sweet and refreshing. Have a cup of mouthwash before meals, and a cup of net taste after meals. The effect of mint tea is just like mints. In addition, roses, cloves, jasmine and other spices are often added to increase the richness of the taste. No.2 Kenya: One side of soil and water side tasteIt is said that Kenya is one of the better developed countries in terms of Africa.Kenyan cuisine can be roughly divided into three parts: the eastern coast, the central rift valley,and the western steppe. When you get to different areas, you eat different things. Eastern Coast: The Seafood WorldWhen you come to the Kenyan coast, how can you not taste the seafood? The buffet only costs 30-50 dollars, and you can taste all the seafood that can be caught on the seabed in Kenya. Most fish are lake in new fresh sea bass and African crucian carp, most of them will belly stuffed with fresh vegetables. The value of the roast is average, but the taste is super! The crispy grilled fish can be eaten with bones, without any fishy smell, it is my dish! (Part A finished, To Be Continued)","link":"/2020/04/25/AfricanFood/"},{"title":"Introdution of Central African Republic","text":"SummaryIt is located in the central African continent, a landlocked country, bordering Sudan in the east, Congo (Brazzaville) and Congo (Kinshasa) in the south, Cameroon in the west and Chad in the north. The northern part has a tropical grassland climate, and the southern part has a tropical rainforest climate. The annual average temperature is 26 ° C. The rainy season is from May to October, and the dry season is from November to April. The official languages are French and Zango. About 50% of the residents believe in Christianity, about 15% believe in Islam and the rest believe in primitive religion. Central Africa has a high incidence of malaria and AIDS, and the HIV infection rate among adults aged 15 to 49 is 3.8% (2015). EconomicsFiscal revenue mainly depends on taxes. After the situation fell into turmoil, the government’s fiscal revenue fell sharply. In 2015, fiscal revenue was US $ 242 million, expenditure was US $280 million, and foreign exchange reserves were US $ 208 million. Established diplomatic relations with the United States in 1963. The United States has 121 peace members in Central Africa. In 2002, the United States closed its embassy in Central Africa. In January 2005, the U.S. embassy in Central Africa reopened; in July,the U.S. embassy’s interim ambassador announced the full restoration of cooperation with China and Africa, and reopened Bangui American Cultural Center. Important HolidaysNew Year’s Day: Just like the other world else, the new year is celebrated by everyone in Africa, some big cities become very lively and students do not need to go to school, lots of people do not need to go to work.Anniversary of Barthélemy Boganda’s Death:After World War I, Equatorial Africa was returned to France. After the Second World War, the black African national independence movement developed day by day. Barthelemy and Pogunda created the “Black African Social Development Movement” to start the struggle for national independence. As a hero, his death became an important day for people in central Africa.Independence Day: After the independence of the Central African Republic from France on August 13, 1960, David Dakota became interim president, and soon became the country’s first president, implementing a one-party dictatorship.National Day: On December 1, 1958, according to Charles de Gaulle’s Constitution,Central Africa became an autonomous republic within the French Community, named Central African Republic.December 1 is also designated as the National Day of the Central African Republic.","link":"/2020/04/25/AfricanRepublic/"},{"title":"Introdution of African Food (2)","text":"Central Rift: Fruit ParadiseThe Central Rift Valley in central Kenya has fertile soil and is an important crop producing area. People who like fresh fruits and vegetables can eat enough here. Bananas are very common in the local area. Steamed bananas are specialty foods with rich texture that are steamed with banana, garlic and onion. The taste is quite fragrant, and I can’t stand the value of this … Passion fruitis called passion fruit locally, and it is often squeezed into fruit juice, sweet and sour. Sugar apple looks like lychee guava.The flesh is milky white and has a sweet taste. It is said to have a beauty effect. Tree tomatoes are also called love fruits in Africa. They are rich in protein and are mostly squeezed to drink. The West: A Paradise for Meat EatersThe western part of Kenya is located in the center of the “African Animal Migration”, so there are many wild animals in particular.Nyama Choma is the most Kenyan-style game dish, which is a grilled meat platter that must not be missed by carnivores. It’s comparable to Xinjiang’s roasted whole lamb. The grilled meat platter is delicious and full of meat. One bite after another is full of meat. You can’t enjoy it anywhere else!In addition, Kenya also has [dumplings], I did not expect it! The Kenyan dumplings are triangular in shape. They are filled with meat fillings, vegetables, onions, peppers, cumin, etc. and fried. Its flavor is strong, crispy on the inside and tender on the outside. Dip a lemon juice before eating,sour and salty at the mouth, and you can eat a plate in one breath! **The curry roast chicken** below is different from the Indian curry chicken. Its curry taste is punchier and the chicken is slightly firewood. Nevertheless, the curry roast chicken has conquered a large number of food with the richness of its curry sauce. No.3 Ethiopia: The most authentic African cuisineUnlike Morocco and Kenya, Ethiopia is the only country in Africa that has not been colonized and has its own traditional cuisine.Therefore, in Ethiopia, you can taste the most authentic African taste. IngelaThis thing called Ingela can be regarded as the national food of Ethiopia. As the saying goes: Shandong pancake rolls all things, Shaanxi meat clips all things. In the same way, this “Ingela” can also “roll all things.” You can roll some beef, and “Beef Pancake Fruit” is ready.Some lamb and bacon roll bar, lamb wrapped in Ingela, the endless flavor straight into the nasal cavity, but also people have no sense of smell. You can even roll around in a mess, as long as you are happy. Vegan Angela can also bring you a different taste. But there is one thing to say,how do I think this Ingela is strange, it feels like something … By the way, isn’t this a rag… AMBO soda AMBO soda was founded in 1930. The water itself has bubbles, but it is completely different from those made from soda. It is very quiet and gentle. If you drink it in one sip, this soda will not make you feel too flush, but it will be easier to import. It can be said to be the PLUS version of “Sea of Words”. Of course, although AMBO soda calls itself “National Drink”,Ethiopia’s “National Drink” must be coffee. Avocado juiceThe juice squeezed by this avocado is the real avocado juice! It is said that squeezing aglass of juice requires three avocados. Concentration is the essence. Drinking a sip is likebeing in the African savannah and racing with the tiger!Truthfully, African fruits are really good. Each kind of fruit is big and juicy. It is delicious! In addition to the above countries, the cuisines of these African countries are also worth remembering: No.4 Ghanaian cuisineFuFuNo.5 NigeriaAfrican Crepes &amp; African Rice]No.6 South AfricaSecret sauce roast chicken]With so many foods from African countries, which country do you like best and whichcountry’s “cuisine” you can’t stand the most?","link":"/2020/04/25/AfricanFoodB/"},{"title":"Intro of Ethiopia","text":"Brief IntroductionThe population is 105 million. There are about 80 ethnic groups in the country, mainly Oromo (40%), Amhara (30%), Tigray (8%), Somalia (6%), and Sidamo (4 %). 45% of the residents believe in Ethiopia, 40-45% believe in Islam, 5% believe in Protestantism, and the rest believe in primitive religion. Amharic is a federal working language, English is also widely used, the main national languages are Oromo,Tigray, etc. One interesting policy for their president is that the “Presidential Bill” passed by the Ethiopian People’s Representative House in October 2001 stipulates that: the president shall be a non-partisan person, shall not have any political organization background, and shall not participate in party activities after leaving office; when the president is unable to perform his duties due to death or illness, Parliament appoints acting president. Economic ConstructionEthiopia is One of the least developed countries in the world. It is dominated by agriculture and animal husbandry, and its industrial foundation is weak. In recent years, Ethiopia has accelerated industrialization and actively built industrial parks. And also they build transportation infrastructure, there is a railway from Addis Ababa to Djibouti standard rail electrified railway provided and financed by China was completed and opened to traffic in October 2016. It was officially put into commercial operation in January 2018 with a total length of about 760 kilometers and a length of about 670 kilometers in Ethiopia. It is the only electrified transnational railway in Ethiopia. In December 2002, Ethiopian Telecom formulated a development plan for the next 20 years, planning to invest 3.5 billion bills to provide telecommunications services to 50 cities across the country. By the end of 2015, there were 42.3 million mobile phone users and 12.4 million network access users. So this may be a good market for us to promote our website. At present, foreign investment is mainly distributed in the real estate, manufacturing, hotel and tourism, construction, education and service industries. The main investment comes from China, the United States, India and Saudi Arabia. ResourceIn Ethiopia, the plateau has more than 2/3 of the country’s area, with an average altitude of nearly 3,000 meters, and is known as the “roof of Africa”. Ethiopia has rich tourism resources, more cultural relics and wildlife parks. The government has taken measures to expand the airport and simplify visa procedures to promote the development of tourism, and plans to make Ethiopia one of the top 10 tourist countries in Africa by 2020. festivalThe important holidays are Victory of Adwa Day: March 2nd; Downfall of the Derg: May 28th; Ethiopian New Year: September 11th. And we can use those holidays to try some promotion ideas to see if it is a good strategy to promote our websites.","link":"/2020/04/25/Ethiopia/"},{"title":"What&#39;s wrong with this world in 2020?","text":"In China, 2019 is yet another end of the zodiac cycle.This year, the world has experienced many terrifying disasters. Novel coronavirusSince December 2019, Wuhan City, Hubei Province, China has continued to carry out surveillance of influenza and related diseases, and found multiple cases of viral pneumonia, all of which were diagnosed with viral pneumonia / pulmonary infection. Common signs of a person infected with a coronavirus include respiratory symptoms, fever, cough, shortness of breath, and dyspnea. In more severe cases, infection can cause pneumonia, severe acute respiratory syndrome, kidney failure, and even death. So far, more than 60,000 people have been isolated and infected, and the death toll has reached thousands. This number is still increasing. The company delayed work and the school delayed the start of school. U.S. deadly fluRecently, the United States has had an influenza that has never been so deadly in 40 years. The 2020 flu has come a little earlier than before. The deadly influenza B virus has reappeared for the first time in 27 years. 13 million people have been infected throughout the United States and at least 10,000 have died Including children. In addition, at least 180,000 people have been hospitalized with flu complications, and this number is expected to rise as influenza activity spreads. Influenza activity is found in almost all regions of the United States and is frequent in 41 of these states. Australian FireAustralia, which lasted for more than 5 months, the raging fire still has not gone out. More than 1,400 kilometers of coastline have burned red, 1.2 billion animals have died tragically, 300,000 bats have invaded Australia, flying around, and numerous forests and land have been destroyed. According to media reports, the fire in Australia emitted a total of 400 million tons of carbon dioxide, which is equivalent to the total annual emissions of more than 100 countries with the lowest carbon dioxide emissions in the world. East African Locust PlagueSince December last year, locust disasters have continued to spread in East Africa. So far, 10 million East Africans have been trapped in locust-ridden areas, and they are faced with a serious dilemma of food insecurity. From a distance, they are like thick smoke; as they keep approaching, billions are only present in front of you, raging like blizzard, uncountable like raindrops, and horrifyingly like greedy monsters . They flapped their wings violently, blocking the sun like an ominous cloud. Pests known and feared by the world’s oldest civilization are invading East Africa Volcano Taal in the Philippines, bird flu in Saudi Arabia, unknown disease in Nigeria, mysterious virus found in Brazil, etc. All this makes people think of the line strayed from the earth: “In the beginning, no one cared about this disaster. It was just a mountain fire, a drought, the extinction of a species, the disappearance of a city. Until this disaster It’s about everyone. The alarm bell of nature has sounded! Man and nature are originally a community of destiny. If humans do not respect the laws of nature, the bitter fruits of environmental degradation will eventually be swallowed by humans themselves.German philosopher Hegel once said: \"The only lesson that human beings can learn from history is that human beings have never learned from history.\" Human beings have never been able to control nature, and human beings have never conquered the earth. Humans cannot conquer the earth, and the only thing we can do is take care of her. It's time to learn to care for animals and live in peace with wildlife. It's time to learn to respect nature and protect the environment.","link":"/2020/04/25/world2020/"}],"tags":[{"name":"network","slug":"network","link":"/tags/network/"},{"name":"food","slug":"food","link":"/tags/food/"},{"name":"African","slug":"African","link":"/tags/African/"},{"name":"Ethiopia","slug":"Ethiopia","link":"/tags/Ethiopia/"},{"name":"disaster","slug":"disaster","link":"/tags/disaster/"}],"categories":[]}